<?php

function F_SinoCal_Format($Date)
{
    $SinomonthsRus = array(1 => 'Малые холода',
        'Большие холода',
        'Начало весны',
        'Дождевая вода',
        'Пробуждение насекомых',
        'Весеннее равноденствие',
        'Ясно и светло',
        'Дожди для злаков',
        'Начало лета',
        'Малое изобилие',
        'Колошение хлебов',
        'Летнее солнцестояние',
        'Малая жара',
        'Большая жара',
        'Начало осени',
        'Прекращение жары',
        'Белые росы',
        'Осеннее равноденствие',
        'Холодные росы',
        'Выпадение инея',
        'Начало зимы',
        'Малые снега',
        'Большие снега',
        'Зимнее солнцестояние');

    $Sinomonths = array(1 => 'Сяохань','Дахань','Личунь','Юйшуй','Дзинчже','Чуньфень','Цинмин','Гуюй','Лися','Сломань','Манчжун','Сячжи','Сяошу','Дашу','Лицю','Чушу','Байлу','Цюфень','Ханьлу','Шуанцзян','Лидун','Сяосюе','Дасюе','Дунчжи');

    $SinoStarts = array (1 => 006,020, 035,050,064,079,095,110,126,141,158,172,188,204,220,235,251,266,281,296,311,326,341,355);


    $DN = strftime('%j',$Date);

    $NumMonth=0;
    foreach ($SinoStarts as $Sino)
        if ($DN>$Sino) $NumMonth++;

    return '<span title="Сезон '.$Sinomonths[$NumMonth].' по китайскому календарю." >年  &nbsp;'.$SinomonthsRus[$NumMonth].'</span>';
}